player_introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-10 Thu 20:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Player Introduction</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="static/stylesheets/default-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Player Introduction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb4d33b">1. Character Setup Steps</a>
<ul>
<li><a href="#org5a9b29f">1.1. Pick a Race </a></li>
<li><a href="#org5de3ca4">1.2. Pick a Class </a></li>
<li><a href="#org743f8f2">1.3. Roll dice to determine ability scores</a></li>
<li><a href="#org16246ba">1.4. Pick your starting gear</a></li>
<li><a href="#orgd6bfd33">1.5. Create a background for your character</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[ <a href="dnd.html#ID-7d419730-2064-41f9-80ee-f24ed9b01ac7">Main Menu</a> ][ <a href="character-sheet.pdf">Blank Character Sheet</a> ]
</p>
</div>
<hr />
<p>
Hello! This is going to be a lot at first, sorry about that. I&rsquo;ve simplified where I can, but the initial setup is going to take a little bit of effort on your part. After that, we can get to the real fun.
</p>

<p>
Please print (or electronically complete) the <b>blank character</b> sheet included here. Be sure to check the <b>reference character</b> sheet if you feel lost, or just reach out to me and I can help out.
</p>

<div id="outline-container-orgfb4d33b" class="outline-2">
<h2 id="orgfb4d33b"><span class="section-number-2">1.</span> Character Setup Steps</h2>
<div class="outline-text-2" id="text-1">
<p>
Complete these five steps and you&rsquo;ll be ready to play your first adventure. Have fun customizing your character, and good luck!
</p>
</div>
<div id="outline-container-org5a9b29f" class="outline-3">
<h3 id="org5a9b29f"><span class="section-number-3">1.1.</span> Pick a <a href="races.html#ID-e6b25898-e7dd-4444-b332-ef9fc3ea59bf">Race</a> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Please pick something you&rsquo;d like to role play as in a long running story, not just a character with the best stats. Each class will have a description of their advantages, disadvantages, class abilities, and other details about a given race in the universe.
</p>

<p>
Please complete the instructions on the race sheet to select your race and set your hit points.
</p>
</div>
</div>
<div id="outline-container-org5de3ca4" class="outline-3">
<h3 id="org5de3ca4"><span class="section-number-3">1.2.</span> Pick a <a href="classes/classes.html#ID-69ef1740-156a-4e42-9493-49ec80a4ac26">Class</a> <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></h3>
<div class="outline-text-3" id="text-1-2">
<p>
Similarly, please pick something you&rsquo;d like to role play as in a long running story, not just the easiest class to fight with. There are many other important parts of the game to consider! Each class also has a set of subclasses that can help you specialize your character. All characters will start at level 1 and will gain all level 1 abilities when the character is created.
</p>

<p>
Please complete the instructions on the class sheet to select your class and subclass. Once you select your class, save that page. It will tell you what to do at each level as your character gains experience. You should also save your subclass page, it will show you what subclass-specific abilities you gain as you level up.
</p>
</div>
</div>
<div id="outline-container-org743f8f2" class="outline-3">
<h3 id="org743f8f2"><span class="section-number-3">1.3.</span> Roll dice to determine ability scores</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You&rsquo;d think this would be uncomplicated. Its not. Sorry. Please keep your character sheet handy and follow along to set your ability scores.
</p>

<p>
On the left hand side of your character sheet there are 6 ability scores:
</p>
<ol class="org-ol">
<li>Strength (STR) <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></li>
<li>Dexterity (DEX) <sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup></li>
<li>Constitution (CON) <sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup></li>
<li>Intelligence (INT) <sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup></li>
<li>Wisdom (WIS) <sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup></li>
<li>Charisma (CHA) <sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup></li>
</ol>

<p>
These are your most valuable attributes; with a combination of luck and your choice, these scores will help determine the possible success of any action you take in the game. A score of 10 or 11 is the normal human average, but adventurers and monsters are a cut above average in most abilities. Adventurers can have scores as high as 20, and monsters and Gods can have scores as high 30.
</p>

<p>
Repeat the following process 6 times to set your ability scores:
</p>
<ol class="org-ol">
<li>Roll 4d6</li>
<li>Pick out the highest 3 dice</li>
<li>Record the sum of those 3 dice on a sheet of paper</li>
</ol>

<p>
With those 6 numbers, place in the <b>smaller bubble</b> beneath each ability score. This number is the raw score for the ability. Weapon and melee focused classes should allocate higher scores to Strength &amp; Dexterity, while spell based classes should focus on Intelligence and Wisdom. Charisma will have a variety of benefits in NPC interaction and Constitution will increase your longevity in battles, however, both are considered non-essential for basic character interactions.
</p>

<p>
Now, fill in the <b>larger section</b> of each ability score with the bonus corresponding to the ability&rsquo;s raw score:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Ability Bonus Table</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Raw Score</th>
<th scope="col" class="org-right">Bonus</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-right">-4</td>
</tr>

<tr>
<td class="org-right">4-5</td>
<td class="org-right">-3</td>
</tr>

<tr>
<td class="org-right">6-7</td>
<td class="org-right">-2</td>
</tr>

<tr>
<td class="org-right">8-9</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">10-11</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">12-13</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">14-15</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-right">16-17</td>
<td class="org-right">+3</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">+4</td>
</tr>
</tbody>
</table>

<p>
Slightly lower and to the right of your ability score are your skills. Each skill will correspond with an ability. On each blank line, write in the <b>bonus</b> that corresponds to each ability. Pick two skills you would like to specialize in bubble the small circle on the left of the skill in, and add +2 to the chosen skills.
</p>

<p>
Repeat the same process with your saving throws (directly above the skills table on your character sheet), but do not bubble in any saving throws. Only write your bonus scores into the blank lines.
</p>

<p>
Your proficiency bonus +2 to start
Your speed is 30 to start
</p>
</div>
</div>
<div id="outline-container-org16246ba" class="outline-3">
<h3 id="org16246ba"><span class="section-number-3">1.4.</span> Pick your starting gear</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Select your equipment based on various difficulty levels. Don&rsquo;t worry, this gear will quickly be replaced, but it should get you to level 3 easily. Record these values in their appropriate places on your character sheet.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Warrior / Monk Loadout Selection</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Easy Loadout</th>
<th scope="col" class="org-left">Recommended Loadout</th>
<th scope="col" class="org-left">Challenge Loadout</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Armor</td>
<td class="org-left">Studded Leather Armor: 12 AC</td>
<td class="org-left">Leather Armor: 11 AC</td>
<td class="org-left">No Armor: 10 AC</td>
</tr>

<tr>
<td class="org-left">Weapon</td>
<td class="org-left">Steel Longsword - 2d6 / slashing (PROF + STR)</td>
<td class="org-left">Iron Spear - 1d8 / piercing (PROF + DEX)</td>
<td class="org-left">Dagger - 1d4 (PROF)</td>
</tr>

<tr>
<td class="org-left">Bonus Items</td>
<td class="org-left">One set of tools</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Wizard / Sorcerer / Druid / Warlock Loadout Selection</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Easy Loadout</th>
<th scope="col" class="org-left">Recommended Loadout</th>
<th scope="col" class="org-left">Challenge Loadout</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Armor</td>
<td class="org-left">Enchanted Robe: 11 AC</td>
<td class="org-left">Enchanted Robe: 11 AC</td>
<td class="org-left">No Armor: 10 AC</td>
</tr>

<tr>
<td class="org-left">Weapon</td>
<td class="org-left">Iron shortsword - 1d6 / slashing (PROF + STR)</td>
<td class="org-left">Dagger - 1d4 / piercing (PROF)</td>
<td class="org-left">Unarmed strike - 1 + STR</td>
</tr>

<tr>
<td class="org-left">Bonus Items</td>
<td class="org-left">One set of tools, One spell slot refill potion</td>
<td class="org-left">One spell slot refill potion</td>
<td class="org-left">One spell slot refill potion</td>
</tr>
</tbody>
</table>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Bard / Merchant / Prophet</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Easy Loadout</th>
<th scope="col" class="org-left">Recommended Loadout</th>
<th scope="col" class="org-left">Challenge Loadout</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Armor</td>
<td class="org-left">Enchanted Robe: 11 AC</td>
<td class="org-left">Enchanted Robe: 11 AC</td>
<td class="org-left">No armor</td>
</tr>

<tr>
<td class="org-left">Weapon</td>
<td class="org-left">Iron shortsword - 1d6 / slashing (PROF + STR)</td>
<td class="org-left">Dagger - 1d4 / piercing (PROF)</td>
<td class="org-left">Unarmed strike - 1 + STR</td>
</tr>

<tr>
<td class="org-left">Bonus Items</td>
<td class="org-left">Two sets of tools, One full-health potion, One half-health potion</td>
<td class="org-left">One set of tools, One full-health potion</td>
<td class="org-left">One half-health potion</td>
</tr>
</tbody>
</table>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 5:</span> Rogue Loadout Selection</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Easy Loadout</th>
<th scope="col" class="org-left">Recommended Loadout</th>
<th scope="col" class="org-left">Challenge Loadout</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Armor</td>
<td class="org-left">Leather armor: 11 AC</td>
<td class="org-left">Leather armor: 11 AC</td>
<td class="org-left">No armor: 10 AC</td>
</tr>

<tr>
<td class="org-left">Weapon</td>
<td class="org-left">Steel shortsword 1d8 / slashing</td>
<td class="org-left">Shank - 1d6 / slashing + piercing (PROF + DEX)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Bonus Items</td>
<td class="org-left">Dagger - 1d4 / piercing (DEX + STR)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 6:</span> Ranger Loadout Selection</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Category</th>
<th scope="col" class="org-left">Easy Loadout</th>
<th scope="col" class="org-left">Recommended Loadout</th>
<th scope="col" class="org-left">Challenge Loadout</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Armor</td>
<td class="org-left">Leather armor: 11 AC</td>
<td class="org-left">Leather armor: 11 AC</td>
<td class="org-left">No armor: 10 AC</td>
</tr>

<tr>
<td class="org-left">Weapon</td>
<td class="org-left">Wood longbow - 1d6 piercing (DEX + STR) + 10 Wood arrows</td>
<td class="org-left">Wood longbow - 1d6 piercing (DEX + STR) + 10 Wood arrows</td>
<td class="org-left">Wood longbow - 1d6 piercing (DEX + STR) + 10 Wood arrows</td>
</tr>

<tr>
<td class="org-left">Bonus Items</td>
<td class="org-left">Iron shortsword - 1d6 / slashing (PROF + STR)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd6bfd33" class="outline-3">
<h3 id="orgd6bfd33"><span class="section-number-3">1.5.</span> Create a background for your character</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This part is all up to you. Who do you want to be in this world?
</p>
<hr />
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Races</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Classes</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Strength</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Dexterity</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Constitution</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Intelligence</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Wisdom</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">Charisma</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-03 Mon 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-08-10 Thu 20:07</p>
</div>
</body>
</html>